package Seminar6;

import java.util.ArrayList;
import java.util.List;

public class Cat {
    /*
    1. РџСЂРѕРґСѓРјР°Р№С‚Рµ СЃС‚СЂСѓРєС‚СѓСЂСѓ РєР»Р°СЃСЃР° РљРѕС‚. РљР°РєРёРµ РїРѕР»СЏ Рё РјРµС‚РѕРґС‹ Р±СѓРґСѓС‚ Р°РєС‚СѓР°Р»СЊРЅС‹ РґР»СЏ РїСЂРёР»РѕР¶РµРЅРёСЏ, РєРѕС‚РѕСЂРѕРµ СЏРІР»СЏРµС‚СЃСЏ
    Р°) РёРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕР№ СЃРёСЃС‚РµРјРѕР№ РІРµС‚РµСЂРёРЅР°СЂРЅРѕР№ РєР»РёРЅРёРєРё
    Р±) Р°СЂС…РёРІРѕРј РІС‹СЃС‚Р°РІРєРё РєРѕС‚РѕРІ
    РІ) РёРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕР№ СЃРёСЃС‚РµРјРѕР№ РўРµР°С‚СЂР° РєРѕС€РµРє Р®. Р”. РљСѓРєР»Р°С‡С‘РІР°
    РњРѕР¶РЅРѕ Р·Р°РїРёСЃР°С‚СЊ РІ С‚РµРєСЃС‚РѕРІРѕРј РІРёРґРµ, РЅРµ РѕР±СЏР·Р°С‚РµР»СЊРЅРѕ СЂРµР°Р»РёР·РѕРІС‹РІР°С‚СЊ РІ java.
    */
    /*
    1. Р РµР°Р»РёР·СѓР№С‚Рµ 1 РёР· РІР°СЂРёР°РЅС‚РѕРІ РєР»Р°СЃСЃР° Cat РёР· РїСЂРµРґС‹РґСѓС‰РµРіРѕ Р·Р°РґР°РЅРёСЏ, РјРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РЅРµ РІСЃРµ РїСЂРёРґСѓРјР°РЅРЅС‹Рµ РїРѕР»СЏ Рё РјРµС‚РѕРґС‹.
    РЎРѕР·РґР°Р№С‚Рµ РЅРµСЃРєРѕР»СЊРєРѕ СЌРєР·РµРјРїР»СЏСЂРѕРІ СЌС‚РѕРіРѕ РєР»Р°СЃСЃР°, РІС‹РІРµРґРёС‚Рµ РёС… РІ РєРѕРЅСЃРѕР»СЊ.
    2. Р”РѕР±РµР№С‚РµСЃСЊ С‚РѕРіРѕ, С‡С‚РѕР±С‹ РїСЂРё РІС‹РІРѕРґРµ РІ РєРѕРЅСЃРѕР»СЊ РѕР±СЉРµРєС‚Р° С‚РёРїР° Cat, РІС‹РІРѕРґРёР»Р°СЃСЊ РµРіРѕ РєР»РёС‡РєР°, С†РІРµС‚
    Рё РІРѕР·СЂР°СЃС‚ (РёР»Рё РґСЂСѓРіРёРµ РїР°СЂР°РјРµС‚СЂС‹ РЅР° РІР°С€Рµ СѓСЃРјРѕС‚СЂРµРЅРёРµ).
     */
    /*
    1. РЎРѕР·РґР°Р№С‚Рµ РјРЅРѕР¶РµСЃС‚РІРѕ, РІ РєРѕС‚РѕСЂРѕРј Р±СѓРґСѓС‚ С…СЂР°РЅРёС‚СЊСЃСЏ СЌРєР·РµРјРїР»СЏСЂС‹ РєР»Р°СЃСЃР° Cat - HashSet<Cat>.
    РџРѕРјРµСЃС‚РёС‚Рµ РІ РЅРµРіРѕ РЅРµРєРѕС‚РѕСЂРѕРµ РєРѕР»РёС‡РµСЃС‚РІРѕ РѕР±СЉРµРєС‚РѕРІ.
    2. РЎРѕР·РґР°Р№С‚Рµ 2 РёР»Рё Р±РѕР»РµРµ РєРѕС‚РѕРІ СЃ РѕРґРёРЅР°РєРѕРІС‹РјРё РїР°СЂР°РјРµС‚СЂР°РјРё РІ РїРѕР»СЏС…. РџРѕРјРµСЃС‚РёС‚Рµ РёС… РІРѕ РјРЅРѕР¶РµСЃС‚РІРѕ.
    РЈР±РµРґРёС‚РµСЃСЊ, С‡С‚Рѕ РІСЃРµ РѕРЅРё СЃРѕС…СЂР°РЅРёР»РёСЃСЊ РІРѕ РјРЅРѕР¶РµСЃС‚РІРѕ.
    3. РЎРѕР·РґР°Р№С‚Рµ РјРµС‚РѕРґ public boolean equals(Object o)
    РџСЂРѕРїРёС€РёС‚Рµ РІ РЅС‘Рј Р»РѕРіРёРєСѓ СЃСЂР°РІРЅРµРЅРёСЏ РєРѕС‚РѕРІ РїРѕ РїР°СЂР°РјРµС‚СЂР°Рј, С…СЂР°РЅРёРјС‹Рј РІ РїРѕР»СЏС….
    РўРѕ РµСЃС‚СЊ, РјРµС‚РѕРґ РґРѕР»Р¶РµРЅ РІРѕР·РІСЂР°С‰Р°С‚СЊ true, С‚РѕР»СЊРєРѕ РµСЃР»Рё Р·РЅР°С‡РµРЅРёСЏ РІРѕ РІСЃРµС… РїРѕР»СЏС… СЃСЂР°РІРЅРёРІР°РµРјС‹С… РѕР±СЉРµРєС‚РѕРІ СЂР°РІРЅС‹.
    4. Р’С‹РІРµРґРёС‚Рµ СЃРЅРѕРІР° СЃРѕРґРµСЂР¶РёРјРѕРµ РјРЅРѕР¶РµСЃС‚РІР° РёР· РїСѓРЅРєС‚Р° 2, СѓР±РµРґРёС‚РµСЃСЊ, С‡С‚Рѕ РґСѓР±Р»РёРєР°С‚С‹ СѓРґР°Р»РёР»РёСЃСЊ
    */
    private String name;
    private String poroda;
    private int age;
    private String owner;
    private List<String> healthHistory;

    public Cat(String name, String poroda, int age, String owner) {
        this.name = name;
        this.poroda = poroda;
        this.age = age;
        this.owner = owner;
        healthHistory = new ArrayList<>();
    }

    public String getName() {
        return name;
    }

    public void addInHistory(String message){
        healthHistory.add(message);
    }

    public int getAge() {
        return age;
    }

    @Override
    public String toString() {
        return "name: " + name + ", poroda: " + poroda + ", age: " + age + ", owner: " + owner;
    }

    @Override
    public boolean equals(Object obj) {
        if (this == obj){
            return true;
        }
        if (!(obj instanceof Cat)){
            return false;
        }
        Cat cat = (Cat) obj;
        return name.equals(cat.name) && poroda.equals(cat.poroda) && age == cat.age && owner.equals(cat.owner);
    }

    @Override
    public int hashCode() {
        return name.hashCode() + 7*age + 11*poroda.hashCode() + 17*owner.hashCode();
    }
}
